docs/loadtest-results/2026-07-27T09-58-55-625Z/k6-shard-4.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/loadtest.js
        output: -

     scenarios: (100.00%) 1 scenario, 98 max VUs, 1m0s max duration (incl. graceful stop):
              * mixed_components: 80.00 iterations/s for 30s (maxVUs: 26-98, gracefulStop: 30s)


running (0m01.0s), 02/26 VUs, 78 complete and 0 interrupted iterations
mixed_components   [   3% ] 02/26 VUs  01.0s/30s  80.00 iters/s

running (0m02.0s), 02/26 VUs, 158 complete and 0 interrupted iterations
mixed_components   [   7% ] 02/26 VUs  02.0s/30s  80.00 iters/s

running (0m03.0s), 00/26 VUs, 240 complete and 0 interrupted iterations
mixed_components   [  10% ] 00/26 VUs  03.0s/30s  80.00 iters/s

running (0m04.0s), 01/26 VUs, 319 complete and 0 interrupted iterations
mixed_components   [  13% ] 01/26 VUs  04.0s/30s  80.00 iters/s

running (0m05.0s), 00/26 VUs, 400 complete and 0 interrupted iterations
mixed_components   [  17% ] 00/26 VUs  05.0s/30s  80.00 iters/s

running (0m06.0s), 00/26 VUs, 480 complete and 0 interrupted iterations
mixed_components   [  20% ] 00/26 VUs  06.0s/30s  80.00 iters/s

running (0m07.0s), 01/26 VUs, 559 complete and 0 interrupted iterations
mixed_components   [  23% ] 01/26 VUs  07.0s/30s  80.00 iters/s

running (0m08.0s), 01/26 VUs, 639 complete and 0 interrupted iterations
mixed_components   [  27% ] 01/26 VUs  08.0s/30s  80.00 iters/s

running (0m09.0s), 01/26 VUs, 719 complete and 0 interrupted iterations
mixed_components   [  30% ] 01/26 VUs  09.0s/30s  80.00 iters/s

running (0m10.0s), 01/26 VUs, 799 complete and 0 interrupted iterations
mixed_components   [  33% ] 01/26 VUs  10.0s/30s  80.00 iters/s

running (0m11.0s), 01/26 VUs, 879 complete and 0 interrupted iterations
mixed_components   [  37% ] 01/26 VUs  11.0s/30s  80.00 iters/s

running (0m12.0s), 01/26 VUs, 959 complete and 0 interrupted iterations
mixed_components   [  40% ] 01/26 VUs  12.0s/30s  80.00 iters/s

running (0m13.0s), 01/26 VUs, 1039 complete and 0 interrupted iterations
mixed_components   [  43% ] 01/26 VUs  13.0s/30s  80.00 iters/s

running (0m14.0s), 01/26 VUs, 1119 complete and 0 interrupted iterations
mixed_components   [  47% ] 01/26 VUs  14.0s/30s  80.00 iters/s

running (0m15.0s), 00/26 VUs, 1200 complete and 0 interrupted iterations
mixed_components   [  50% ] 00/26 VUs  15.0s/30s  80.00 iters/s

running (0m16.0s), 00/26 VUs, 1280 complete and 0 interrupted iterations
mixed_components   [  53% ] 00/26 VUs  16.0s/30s  80.00 iters/s

running (0m17.0s), 00/26 VUs, 1360 complete and 0 interrupted iterations
mixed_components   [  57% ] 00/26 VUs  17.0s/30s  80.00 iters/s

running (0m18.0s), 00/26 VUs, 1440 complete and 0 interrupted iterations
mixed_components   [  60% ] 00/26 VUs  18.0s/30s  80.00 iters/s

running (0m19.0s), 00/26 VUs, 1520 complete and 0 interrupted iterations
mixed_components   [  63% ] 00/26 VUs  19.0s/30s  80.00 iters/s

running (0m20.0s), 01/26 VUs, 1599 complete and 0 interrupted iterations
mixed_components   [  67% ] 01/26 VUs  20.0s/30s  80.00 iters/s

running (0m21.0s), 00/26 VUs, 1680 complete and 0 interrupted iterations
mixed_components   [  70% ] 00/26 VUs  21.0s/30s  80.00 iters/s

running (0m22.0s), 02/26 VUs, 1758 complete and 0 interrupted iterations
mixed_components   [  73% ] 02/26 VUs  22.0s/30s  80.00 iters/s

running (0m23.0s), 00/26 VUs, 1840 complete and 0 interrupted iterations
mixed_components   [  77% ] 00/26 VUs  23.0s/30s  80.00 iters/s

running (0m24.0s), 00/26 VUs, 1920 complete and 0 interrupted iterations
mixed_components   [  80% ] 00/26 VUs  24.0s/30s  80.00 iters/s

running (0m25.0s), 00/26 VUs, 2000 complete and 0 interrupted iterations
mixed_components   [  83% ] 00/26 VUs  25.0s/30s  80.00 iters/s

running (0m26.0s), 01/26 VUs, 2079 complete and 0 interrupted iterations
mixed_components   [  87% ] 01/26 VUs  26.0s/30s  80.00 iters/s

running (0m27.0s), 01/26 VUs, 2159 complete and 0 interrupted iterations
mixed_components   [  90% ] 01/26 VUs  27.0s/30s  80.00 iters/s

running (0m28.0s), 01/26 VUs, 2239 complete and 0 interrupted iterations
mixed_components   [  93% ] 01/26 VUs  28.0s/30s  80.00 iters/s

running (0m29.0s), 00/26 VUs, 2320 complete and 0 interrupted iterations
mixed_components   [  97% ] 00/26 VUs  29.0s/30s  80.00 iters/s

running (0m30.0s), 00/26 VUs, 2400 complete and 0 interrupted iterations
mixed_components   [ 100% ] 00/26 VUs  30.0s/30s  80.00 iters/s


  █ TOTAL RESULTS 

    CUSTOM
    signals_accepted_202...........: 649    21.63864/s
    signals_rate_limited_429.......: 1752   58.414325/s
    signals_sampled_sent...........: 44     1.467026/s

    HTTP
    http_req_duration..............: avg=4.44ms min=666.48µs med=2.32ms max=70.42ms p(50)=2.32ms p(95)=13.18ms p(99)=39.55ms
      { expected_response:true }...: avg=4.44ms min=666.48µs med=2.32ms max=70.42ms p(50)=2.32ms p(95)=13.18ms p(99)=39.55ms
    http_req_failed................: 0.00%  0 out of 2401
    http_reqs......................: 2401   80.052964/s

    EXECUTION
    iteration_duration.............: avg=4.83ms min=849.73µs med=2.69ms max=70.9ms  p(50)=2.69ms p(95)=13.76ms p(99)=40.23ms
    iterations.....................: 2401   80.052964/s
    vus............................: 0      min=0         max=3 
    vus_max........................: 26     min=26        max=26

    NETWORK
    data_received..................: 2.7 MB 89 kB/s
    data_sent......................: 1.2 MB 39 kB/s



running (0m30.0s), 00/26 VUs, 2401 complete and 0 interrupted iterations
mixed_components ✓ [ 100% ] 00/26 VUs  30s  80.00 iters/s